build/docs/runtime/emgrs/svem/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Application's Entity Manager</title>
<!-- 2017-04-27 Thu 09:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
</head>
<body>
<div id="content">
<h1 class="title">The Application's Entity Manager</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Constraints implemented by the Application's Entity Manager</a></li>
<li><a href="#sec-3">3. Inherit and Register objects as entities</a></li>
<li><a href="#sec-4">4. User operations</a>
<ul>
<li><a href="#sec-4-1">4.1. Add User</a></li>
<li><a href="#sec-4-2">4.2. Delete User</a></li>
<li><a href="#sec-4-3">4.3. Update User</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Session</a>
<ul>
<li><a href="#sec-5-1">5.1. Add Session</a></li>
<li><a href="#sec-5-2">5.2. Delete Session</a></li>
<li><a href="#sec-5-3">5.3. Update Session</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document defines <code>EntityMgr</code>, the entity manager for
the user directory application.  
</p>

<p>
It does the following:
</p>


<ol class="org-ol">
<li>Inherits from the utility <a href="../../utils/entitymgrs/volatile/safe/index.html">SafeVolatileEntityMgr</a>.  
</li>

<li>Registers <code>User</code> and <code>Session</code> objects as entities and
allows for safe CRUD operations on them.
</li>

<li>Implements the operations on <code>User</code> and <code>Session</code>
     entities. 
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Constraints implemented by the Application's Entity Manager</h2>
</div>




<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Inherit and Register objects as entities</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">from</span>  runtime.objects.user.user <span style="font-weight: bold;">import</span> User
<span style="font-weight: bold;">from</span>  runtime.objects.session.session <span style="font-weight: bold;">import</span> Session
<span style="font-weight: bold;">from</span>  runtime.utils.entitymgrs.volatile.safe.svem <span style="font-weight: bold;">import</span> SafeVolatileEntityMgr
<span style="font-weight: bold;">from</span> runtime.utils.type_utils.type_utils <span style="font-weight: bold;">import</span> check_pred

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">EntityMgr</span>(SafeVolatileEntityMgr):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):

        SafeVolatileEntityMgr.__init__(<span style="font-weight: bold;">self</span>)

        <span style="font-weight: bold;">self</span>.register_as_entity(User)
        <span style="font-weight: bold;">self</span>.register_as_entity(Session)
</pre>
</div>

<p>
Then, operations on the entities are defined using the
generic operations inherited from <a href="../../utils/entitymgrs/volatile/safe/index.html">SafeVolatileEntityMgr</a>.
</p>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> User operations</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Add User</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">add_user</span>(<span style="font-weight: bold;">self</span>, user):
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">check if user satisfies the User.is_inst predicate</span>
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">i.e., if user is an instance of User</span>
        check_pred(User.is_inst)(user)
        <span style="font-weight: bold;">self</span>.safe_add(user)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Delete User</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">delete_user</span>(<span style="font-weight: bold;">self</span>, user):
        check_pred(User.is_inst)(user)
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">make sure there is no session whose user is the given user </span>
        check_pred(<span style="font-weight: bold;">lambda</span> u: <span style="font-weight: bold;">self</span>.apply_filters(Session, user=u) == [])(user)
        <span style="font-weight: bold;">self</span>.safe_delete(user)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Update User</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">update_user</span>(<span style="font-weight: bold;">self</span>, user, **args):
        check_pred(User.is_inst)(user)
        <span style="font-weight: bold;">self</span>.safe_update(user, **args)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Session</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Add Session</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">add_session</span>(<span style="font-weight: bold;">self</span>, session):
        check_pred(Session.is_inst)(session)
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">make sure that the user of the session</span>
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">exists in the user set</span>
        check_pred(<span style="font-weight: bold;">lambda</span> s: <span style="font-weight: bold;">self</span>.is_present(s.get(<span style="font-style: italic;">'user'</span>)))(session)
        <span style="font-weight: bold;">self</span>.safe_add(session)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Delete Session</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">delete_session</span>(<span style="font-weight: bold;">self</span>, session):
        check_pred(Session.is_inst)(session)
        <span style="font-weight: bold;">self</span>.safe_delete(session)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Update Session</h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">update_session</span>(<span style="font-weight: bold;">self</span>, session, **args):
        check_pred(Session.is_inst)(session)
        <span style="font-weight: bold;">self</span>.safe_update(session, **args)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-04-22 Sat]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-04-27 Thu 09:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
